MusicApp/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["email", "f2rf2f2f"], ["password_digest", "afwevev"], ["session_token", "IDjZneynb8v2AaTnFkNN3w"], ["created_at", "2018-09-13 20:49:06.504111"], ["updated_at", "2018-09-13 20:49:06.504111"]]
---
  def create
    @user = User.new(user_params)
    if user.save